# Tarea 2:

## Pandas

La tarea la debe resolver directamente sobre este *notebook*. Le deben cambiar el nombre al *notebook* sustituyendo el nombre y el apellido. Por ejemplo:
`Tarea2_wladimir_rodriguez.ipynb`. La tarea deben enviarla al correo electrónico `wladimir@ula.ve` antes de la hora de clase (10am) del día jueves 30 de junio .

In [1]:
# importando pandas usando la convención
import pandas as pd

In [2]:
# Cargar base de datos imdb de títulos de peliculas
titulos = pd.read_csv('../datos/titles.csv' )
titulos.head()

                                   title  year
0                                 Mahler  1974
1           Ogon, voda i... mednye truby  1968
2  Ana Nojoom bent alasherah wamotalagah  2014
3                      Malu de Bicicleta  2010
4             Nazareno Apostol: Boy Ahas  1989

In [3]:
titulos.tail()

                       title  year
230402         El lobo negro  1981
230403  Komu na Rusi zhit...  1989
230404              Senotaji  2013
230405     The Leopard Woman  1920
230406    Mio caro assassino  1972

In [4]:
# Cuantas películas estan listadas en el dataframe de títulos?
len(titulos)

230407

### Ejercicios

In [ ]:
# 1. ¿Cuántas películas estan listadas por el nombre "Dracula"?

In [ ]:
# 2. Títulos mas comunes en la historia filmografica

In [ ]:
# 3. ¿Cuál fue la primer película hecha titulada "Romeo and Juliet"?

In [ ]:
# 4. Listar todas las películas que contengan la palabra "Exorcist" 
# ordenadas de la mas vieja a la mas reciente.

In [ ]:
# 5. ¿Cuántas películas fueron hechas en el año 1950?

In [ ]:
# 6. ¿Cuántas películas fueron hechas en el año 1970?

In [ ]:
# 7. ¿Cuántas películas fueron hechas de 1950 a 1959

In [ ]:
# 8. En que años alguna película llamada "Batman" se presento

In [ ]:
# 9. En cual año hay mas películas

In [ ]:
# 10. En cual año hay menos películas